---
kind: type
id: T:Autodesk.Revit.UI.DockablePaneState
source: html/0255200b-8af3-3254-ca6b-043f5cc291cf.htm
---
# Autodesk.Revit.UI.DockablePaneState

Describes where a dockable pane window should appear in the Revit user interface.

## Syntax (C#)
```csharp
public class DockablePaneState : IDisposable
```